{
"source_systems": [
     {
          "internal": {
               "user_story": "US518",
               "big_data_owner": "Dinko Pita"  
          },
          "app_metadata":{
               "app_id": "APP-978",
               "source": "CSCI",
               "data_description": ["CSCI (Customer Service Configuration Inventory) obtains from the XDM (Telstra application), ADSL network topology and basic customer details associated with an activation. This system provides a database of record for all Cross Domain Data including Topology information",
               "Scope is for 5 files",
               "1. All fields file",
               "2. dslam_bras_bng",
               "3. adsl_summary",
               "4. topology",
               "5. bras_bng_region",
               "Description:",
               "1. ALL Fields: Report will provide details on unique path applicable to each service as determined by their access links.Services provisioned on the access link that has resiliency will be replicated for each unique path used by the access link.",
               "2. DSLAM_BRAS_BNG: This report provides a mapping of DSLAMs to BRAS (Broadband Remote Access Server)/BNG (Broadband Network Gateway) devices including the slots,module and ports identifier used for providing the connectivity.",
               "3.ADSL_Summary: Report displays ADSL service(topology) details and also provides slot,ports and module details for  DSLAM and  BRAS/BNG used to provide the service.",
               "4.Topology: Report displays topology detail i.e.  provides device name,type,slot,ports and module details for all devices  used to provide the service.",
               "5.BRAS_BNG_Region:Displays the details on region for all the BRAS/BNG."],
               "data_layout": ["http://objects.in.telstra.com.au/documents/BEE-1476 IACS,",
               "http://objects.in.telstra.com.au/documents/BDU-7285 IASS"]
          },
          "technical_details":{
               "host_names": "CSCI Test - wsweb0587.in.telstra.com.au,
               CSCI Prod - wsweb0586.in.telstra.com.au",
               "host_ip": "CSCI Test: 144.135.81.238,
               CSCI Prod:144.135.168.69",
               "port_number": "Test and Prod: 22",
               "network": "EDN (Test and Prod)",
               "db_instance": "NA",
               "file_location_on_server": "Source location is not required. Destination location needs to be provided",
               "api_data_sourcing_string": "NA",
               "other_comments": " Agreed to send test data from CSCI Test to Big Data Test. 
               Big Data will use this data structure to construct Big Data queries.
               Once Big Data Prodcution is up: CSCI Prod to Big Data Prod.
               Big Data  will setup firewalls. CSCI will provide subnet mask details."
          },
          "tracking":{
          "firewall_status": ""
          }
     }]
}